{"id":305,"date":"2020-08-04T03:45:53","date_gmt":"2020-08-04T03:45:53","guid":{"rendered":"http:\/\/localhost\/abramba\/?p=305"},"modified":"2020-08-25T06:47:19","modified_gmt":"2020-08-25T06:47:19","slug":"solar-project-in-the-democratic-republic-of-the-congo-wins-phanes-groups-third-solar-incubator","status":"publish","type":"post","link":"http:\/\/localhost\/abramba\/2020\/08\/04\/solar-project-in-the-democratic-republic-of-the-congo-wins-phanes-groups-third-solar-incubator\/","title":{"rendered":"Solar Project in The Democratic Republic of the Congo wins Phanes Group’s third Solar Incubator"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"305\" class=\"elementor elementor-305\" data-elementor-settings=\"[]\">\n\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-element elementor-element-87ab728 elementor-section-boxed elementor-section-height-default elementor-section-height-default elementor-section elementor-top-section\" data-id=\"87ab728\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t<div class=\"elementor-element elementor-element-e19ec81 elementor-column elementor-col-100 elementor-top-column\" data-id=\"e19ec81\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap  elementor-element-populated\">\n\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t<div class=\"elementor-element elementor-element-83924fb elementor-widget elementor-widget-heading\" data-id=\"83924fb\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h3 class=\"elementor-heading-title elementor-size-default\">International evaluation panel selected winning project for commercial and technical support from global solar company <\/h3>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-eab08da elementor-widget elementor-widget-text-editor\" data-id=\"eab08da\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\"><p id=\"yui_3_17_2_1_1596512721284_263\" class=\"\"><strong id=\"yui_3_17_2_1_1596512721284_262\">Dakar, Senegal – October 17, 2019: Phanes Group, an international end-to-end solar developer headquartered in Dubai, UAE, has announced Mr. Justin Nseya and his Congo Green Energy Project (2 x 50 MW) as the winner of the third edition of its Solar Incubator. The announcement was made at the “Unlocking Solar Capital: Africa” conference in Dakar, Senegal, where three finalists presented their proposal to a panel of international industry experts from Power Africa, ECREEE, 3E, Solarplaza and Phanes Group. <\/strong><\/p><p class=\"\"><img loading=\"lazy\" class=\"size-medium wp-image-297 alignright\" src=\"http:\/\/localhost\/abramba\/wp-content\/uploads\/2020\/07\/Thumbnail-TheBig5-300x300.png\" alt=\"\" width=\"300\" height=\"300\" srcset=\"http:\/\/localhost\/abramba\/wp-content\/uploads\/2020\/07\/Thumbnail-TheBig5-300x300.png 300w, http:\/\/localhost\/abramba\/wp-content\/uploads\/2020\/07\/Thumbnail-TheBig5-150x150.png 150w, http:\/\/localhost\/abramba\/wp-content\/uploads\/2020\/07\/Thumbnail-TheBig5.png 500w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/>“We are proud to announce Justin Nseya as the winner of this year’s Solar Incubator. It was a close call, as again there was some tough competition – all the finalists presented projects which had the ability to transform their communities positively in many ways. There is a great deal of talent on the continent who have amazing potential to benefit from our platform, which is why we want to continue the initiative,” said Andrea Haupts, COO of Phanes Group.<\/p><p class=\"\">Maintaining a long-term stake in the project, Mr. Nseya and Phanes Group will work collaboratively, aiming to bring the solar energy project to financial close. The Solar Incubator phase will kick off with an intensive face-to-face workshop for Mr. Nseya in Dubai, UAE, where he will work with Phanes Group’s team and its incubator partners to set the foundations to deliver a bankable project. During that phase, Mr. Nseya will gain access to commercial and technical know-how covered by experts from project finance, project development and execution, legal, marketing and CSR, followed by further remote mentoring sessions in the succeeding months.<\/p><p class=\"\">“Mr. Nseya’s project convinced the evaluation panel, not only with its strong CSR component but especially with his knowledge and commitment to the region where he hails from. He showed strong determination to bring his project to life in a challenging market environment. We believe this is where Phanes Group and its incubator partners can create the most positive impact, through the workshop and ongoing mentoring and knowledge sharing,” Mrs. Haupts added. “We look forward to welcoming him to Dubai and want to encourage the other candidates to keep persevering in bringing their proposals to fruition, as everyone would have deserved to win.” The goal of the Phanes Group Solar Incubator, held under the theme, “Your Project, Our Expertise, For a Sustainable Future,” is to provide access to commercial and technical knowledge, and eventually funding, to promising locally developed PV projects in sub-Saharan Africa, and to help entrepreneurs overcome obstacles that could prevent solar initiatives from reaching fruition.<\/p><p class=\"\">For more information regarding the Phanes Group Solar Incubator, please visit our webpage www.phanesgroup.com\/incubator<\/p><p class=\"\"><strong>More About Phanes Group <\/strong><\/p><p class=\"\">Phanes Group is an international solar energy developer, investment manager and asset manager, strategically headquartered in Dubai, UAE. Established in 2012, Phanes Group’s integrated approach, combining financial and engineering expertise, enables the company to deliver end-to-end solar energy solutions. Phanes Group has a growing portfolio of solar investments and developments spanning multiple geographies, with a distinct focus on emerging markets &#8211; especially Africa, the Middle East, Central Asia and the Commonwealth Independent States (CIS). The company delivered the Middle East’s largest distributed solar project (the DP World Solar Power Programme) and has delivered Phase I of the largest solar project in the Caribbean (Monte Plata). It has additionally begun development on a pipeline of 400 MW across three countries in Central Asia To date, Phanes Group’s global clean power contribution is in excess of 75 MW, with a further 1.5 GW under development or at the planning stage globally. Phanes Group has a dedicated asset construction division, Oryx Solar System Solutions LLC, delivering Phanes Group’s projects as well as offering Operations &amp; Maintenance (O&amp;M) services. Phanes Group also has satellite offices in Nigeria and Kazakhstan.<\/p><p class=\"\"><strong>More about Phanes Group’s Solar Incubator <\/strong><\/p><p class=\"\">Phanes Group’s Solar Incubator held under the theme of “Your Project, Our Expertise, For a Sustainable Future”, is supported by top-tier international partners such as ECREEE, Power Africa, 3E and Solarplaza. The initiative aims to select and develop PV project opportunities in sub-Saharan Africa that haven’t been able to gain access to funding and necessary know-how. Corporate Social Responsibility (CSR) is an integral part of this initiative; along with the project details a solid CSR concept must be submitted and will be jointly developed with Phanes Group during the incubator phase and implemented in parallel with execution of the PV project.<\/p><\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>International evaluation panel selected winning project for commercial and technical support from global solar company Dakar, Senegal – October 17, 2019: Phanes Group, an international end-to-end solar developer headquartered in Dubai, UAE, has announced Mr. Justin Nseya and his Congo Green Energy Project (2 x 50 MW) as the winner of the third edition of &hellip;<\/p>\n<p class=\"read-more\"> <a class=\"\" href=\"http:\/\/localhost\/abramba\/2020\/08\/04\/solar-project-in-the-democratic-republic-of-the-congo-wins-phanes-groups-third-solar-incubator\/\"> <span class=\"screen-reader-text\">Solar Project in The Democratic Republic of the Congo wins Phanes Group’s third Solar Incubator<\/span> Read More &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/posts\/305"}],"collection":[{"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/comments?post=305"}],"version-history":[{"count":4,"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/posts\/305\/revisions"}],"predecessor-version":[{"id":390,"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/posts\/305\/revisions\/390"}],"wp:attachment":[{"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/media?parent=305"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/categories?post=305"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/abramba\/wp-json\/wp\/v2\/tags?post=305"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}